Enums/Д_ИдентификаторМетода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Д_ИдентификаторМетода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПослеЗаписиНаСервере</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Д_ТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Д_ТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Д_ИнтеграцияСJira/Ext/Module.bsl
Процедура ПриСозданииНаСервере(ЭтотОбъект) Экспорт
	
	Если НЕ УправлениеДоступом.ЕстьРоль("Д_РаботаСJira") Тогда
		Возврат;
	КонецЕсли;	
		
	Форма = ЭтотОбъект.ЭтаФорма;
	
	ПодменюКнопокФормы = Форма.Элементы.Добавить("ФормаМенюИнтеграцияJira", Тип("ГруппаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
	ПодменюКнопокФормы.Вид = ВидГруппыФормы.Подменю;
	ПодменюКнопокФормы.Заголовок = "Интеграция Jira";
	ПодменюКнопокФормы.Картинка = БиблиотекаКартинок.Д_КартинкаJira;
	
	КомандаСоздатьШаблон = Форма.Команды.Добавить("Подключаемый_СоздатьШаблонИнтеграцииJira");
	КомандаСоздатьШаблон.Действие = "Подключаемый_ИнтеграцияJiraВыполнитьКоманду";
	
	КнопкаСоздатьШаблон = Форма.Элементы.Добавить("СоздатьШаблонИнтеграции", Тип("КнопкаФормы"), Форма.Элементы.ФормаМенюИнтеграцияJira);
	КнопкаСоздатьШаблон.Заголовок = "Создать шаблон интеграции";
	КнопкаСоздатьШаблон.ИмяКоманды = "Подключаемый_СоздатьШаблонИнтеграцииJira";
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(ТекущийОбъект) Экспорт
	
	ИдентификаторМетода = Перечисления.Д_ИдентификаторМетода.ПослеЗаписиНаСервере;
	ОбработкаЗапросов(ТекущийОбъект, ИдентификаторМетода);
	
КонецПроцедуры

Процедура ОбработкаЗапросов(ТекущийОбъект, ИдентификаторМетода)
	
	ОбъектСсылка = ТекущийОбъект.Ссылка;
	ТипыЗапросовПоОбъекту = Д_ИнтеграцияСJiraВызовСервера.НазначенныеТипыЗапросовПоОбъекту(ОбъектСсылка);
	
	Для каждого ТипЗапроса Из ТипыЗапросовПоОбъекту Цикл
		МассивСтруктурДанных = ПолучитьМассивСтруктурДанных(ОбъектСсылка, ИдентификаторМетода, ТипЗапроса);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМассивСтруктурДанных(ОбъектСсылка, ИдентификаторМетода, ТипЗапроса)
	
	МассивСопоставленныхПараметров = Новый Массив();
	
	// Формируем структуру для вызова метода ++
	ПараметрыСозданияСтруктуры = Новый Структура();
	СтруктураМетаданных = Д_ИнтеграцияСJiraВызовСервера.ПолучитьСтруктуруМетаданных(ОбъектСсылка);
	ПараметрыСозданияСтруктуры.Вставить("ТипОбъекта", ?(СтруктураМетаданных.ТипДокумента = "Документ", Перечисления.Д_ТипыОбъектов.Документ, Перечисления.Д_ТипыОбъектов.Справочник)); 
	ПараметрыСозданияСтруктуры.Вставить("ИмяОбъекта", СтруктураМетаданных.ИмяДокумента);
	ПараметрыСозданияСтруктуры.Вставить("ТипЗапроса", ТипЗапроса);
	ПараметрыСозданияСтруктуры.Вставить("ВызываемыйМетод", ИдентификаторМетода);
	// --
	МассивСопоставленныхПараметров = Д_ИнтеграцияСJiraВызовСервера.ПолучитьСопоставленныеПараметры(ПараметрыСозданияСтруктуры);
	
	Возврат МассивСопоставленныхПараметров;
	
КонецФункции

Процедура СопоставитьПоляЗапроса()
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруДанныхКлючами()
	
КонецПроцедуры
